stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_rcc.h
  uint32_t LSEState;             /*!< The new state of the LSE.
                                      This parameter can be a value of @ref RCC_LSE_Config                        */

  uint32_t LSIState;             /*!< The new state of the LSI.
                                      This parameter can be a value of @ref RCC_LSI_Config                        */

  uint32_t LSEBYPASSState;       /*!< The new state of the LSE Bypass.
                                      This parameter can be a value of @ref RCC_LSEBYPASS_Config                  */
} RCC_OscInitTypeDef;

/**
  * @brief  RCC System clock configuration structure definition
  */
typedef struct
{
  uint32_t SYSCLKSource;          /*!< The clock source used as system clock (SYSCLK).
                                       This parameter can be a value of @ref RCC_System_Clock_Source    */

  uint32_t SYSCLKDivider;         /*!< The clock divider used as system clock (SYSCLK).
                                       This parameter can be a value of @ref RCC_RC64MPLL_Clock_Divider or
                                       @ref RCC_DIRECT_HSE_Clock_Divider */
} RCC_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */

/** @defgroup RCC_Timeout_Value Timeout Values
  * @{
  */
#define RCC_LSE_TIMEOUT_VALUE          LSE_STARTUP_TIMEOUT  /* LSE timeout in ms        */
/**
  * @}
  */

/** @defgroup RCC_HSI_CALIBRATION_DEFAULT HSI default calibration trimming value
  * @{
  */
#define RCC_HSICALIBRATION_DEFAULT     0x1FU        /*!< Default HSI calibration trimming value */
/**
  * @}
  */

/** @defgroup RCC_Oscillator_Type Oscillator Type
  * @{
  */
#define RCC_OSCILLATORTYPE_HSI         0x00000010U   /*!< Oscillator configuration unchanged  */
#define RCC_OSCILLATORTYPE_NONE         0x00000000U   /*!< Oscillator configuration unchanged  */
#define RCC_OSCILLATORTYPE_HSE         0x00000001U   /*!< HSE to configure                    */
#define RCC_OSCILLATORTYPE_LSE         0x00000002U   /*!< LSE to configure                    */
#define RCC_OSCILLATORTYPE_LSI         0x00000004U   /*!< LSI to configure                    */
#define RCC_OSCILLATORTYPE_LSE_BYPASS  0x00000008U   /*!< Slow clock is directly provided     */
/**
  * @}
  */

/** @defgroup RCC_HSI_Config HSI Config
  * @{
  */
#define RCC_HSI_OFF                   RCC_CFGR_STOPHSI     /*!< HSI clock activation   */
#define RCC_HSI_ON                    0x00000000U          /*!< HSI clock deactivation */
/**
  * @}
  */

/** @defgroup RCC_HSE_Config HSE Config
  * @{
  */
#define RCC_HSE_OFF                    0x00000000U      /*!< HSE clock deactivation */
#define RCC_HSE_ON                     RCC_CR_HSEON     /*!< HSE clock activation   */
/**
  * @}
  */

/** @defgroup RCC_LSE_Config LSE Config
  * @{
  */
#define RCC_LSE_OFF                    0x00000000U     /*!< LSE clock deactivation */
#define RCC_LSE_ON                     RCC_CR_LSEON    /*!< LSE clock activation   */
/**
  * @}
  */

/** @defgroup RCC_LSI_Config LSI Config
  * @{
  */
#define RCC_LSI_OFF                    0x00000000U     /*!< LSI clock deactivation */
#define RCC_LSI_ON                     RCC_CR_LSION    /*!< LSI clock activation   */
/**
  * @}
  */

/** @defgroup RCC_LSEBYPASS_Config LSE BYPASS Config
  * @{
  */
#define RCC_LSE_BYPASS_OFF             0x00000000U     /*!< LSE clock deactivation */
#define RCC_LSE_BYPASS_ON              RCC_CR_LSEBYP   /*!< LSE clock activation   */
/**
  * @}
  */

/** @defgroup RCC_RF_Clock  RF Clock
  * @{
  */
#define RCC_RF_CLK_16M       LL_RCC_RF_CLK_16M   /*!< RF system clock 16 MHz*/
#define RCC_RF_CLK_32M       LL_RCC_RF_CLK_32M   /*!< RF system clock 32 MHz */
/**
  * @}
  */

/** @defgroup RCC_DIRECT_HSE_Clock_Divider DIRECT HSE Clock Divider
  * @{
  */
#define RCC_DIRECT_HSE_DIV1              LL_RCC_DIRECT_HSE_DIV_1   /*!< DIRECT HSE division factor = 1   */
#define RCC_DIRECT_HSE_DIV2              LL_RCC_DIRECT_HSE_DIV_2   /*!< DIRECT HSE division factor = 2   */
#define RCC_DIRECT_HSE_DIV4              LL_RCC_DIRECT_HSE_DIV_4   /*!< DIRECT HSE division factor = 4   */
#define RCC_DIRECT_HSE_DIV8              LL_RCC_DIRECT_HSE_DIV_8   /*!< DIRECT HSE division factor = 8   */
#define RCC_DIRECT_HSE_DIV16             LL_RCC_DIRECT_HSE_DIV_16  /*!< DIRECT HSE division factor = 16  */
#define RCC_DIRECT_HSE_DIV32             LL_RCC_DIRECT_HSE_DIV_32  /*!< DIRECT HSE division factor = 32  */
/**
  * @}
  */

/** @defgroup RCC_RC64MPLL_Clock_Divider RC64MPLL Clock Divider
  * @{
  */
#define RCC_RC64MPLL_DIV1              LL_RCC_RC64MPLL_DIV_1    /*!< RC64MPLL division factor = 1   */
#define RCC_RC64MPLL_DIV2              LL_RCC_RC64MPLL_DIV_2    /*!< RC64MPLL division factor = 2   */
#define RCC_RC64MPLL_DIV4              LL_RCC_RC64MPLL_DIV_4    /*!< RC64MPLL division factor = 4   */
#define RCC_RC64MPLL_DIV8              LL_RCC_RC64MPLL_DIV_8    /*!< RC64MPLL division factor = 8   */
#define RCC_RC64MPLL_DIV16             LL_RCC_RC64MPLL_DIV_16   /*!< RC64MPLL division factor = 16  */
#define RCC_RC64MPLL_DIV32             LL_RCC_RC64MPLL_DIV_32   /*!< RC64MPLL division factor = 32  */
#define RCC_RC64MPLL_DIV64             LL_RCC_RC64MPLL_DIV_64   /*!< RC64MPLL division factor = 64  */
/**
  * @}
  */

/** @defgroup RCC_Clock_SWITCH_Divider Clock Switch Divider
  * @{
  */
#define RCC_RC64MPLL_SWITCH_DIV1           LL_RCC_RC64MPLL_SWITCH_DIV_1    /*!< RC64MPLL division factor = 1   */
#define RCC_RC64MPLL_SWITCH_DIV2           LL_RCC_RC64MPLL_SWITCH_DIV_2    /*!< RC64MPLL division factor = 2   */
#define RCC_RC64MPLL_SWITCH_DIV4           LL_RCC_RC64MPLL_SWITCH_DIV_4    /*!< RC64MPLL division factor = 4   */
#define RCC_DIRECT_HSE_SWITCH_DIV1         LL_RCC_RC64MPLL_SWITCH_DIV_2    /*!< Direct HSE division factor = 1 */
#define RCC_DIRECT_HSE_SWITCH_DIV2         LL_RCC_RC64MPLL_SWITCH_DIV_4    /*!< Direct HSE division factor = 2 */
/**
  * @}
  */

