stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_rcc.h
#define __HAL_RCC_RADIO_CLK_DISABLE()           LL_APB2_GRP1_DisableClock(LL_APB2_GRP1_PERIPH_MRBLE)
#endif

/**
  * @}
  */

/** @defgroup RCC_AHB_Peripheral_Clock_Enable_Disable_Status AHB Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the AHB peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_DMA_IS_CLK_ENABLED()             LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_GPIOA_IS_CLK_ENABLED()           LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_IS_CLK_ENABLED()           LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_CRC_IS_CLK_ENABLED()             LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_CRC)
#if defined(PKA)
#define __HAL_RCC_PKA_IS_CLK_ENABLED()             LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_PKA)
#endif
#define __HAL_RCC_RNG_IS_CLK_ENABLED()             LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_RNG)


#define __HAL_RCC_DMA_IS_CLK_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_DMA))
#define __HAL_RCC_GPIOA_IS_CLK_DISABLED()          !(LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_GPIOA))
#define __HAL_RCC_GPIOB_IS_CLK_DISABLED()          !(LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_GPIOB))
#define __HAL_RCC_CRC_IS_CLK_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_CRC))
#if defined(PKA)
#define __HAL_RCC_PKA_IS_CLK_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_PKA))
#endif
#define __HAL_RCC_RNG_IS_CLK_DISABLED()            !(LL_AHB1_GRP1_IsEnabledClock(LL_AHB1_GRP1_PERIPH_RNG))

/**
  * @}
  */

/** @defgroup RCC_APB0_Clock_Enable_Disable_Status APB0 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB0 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#if defined(TIM1)
#define __HAL_RCC_TIM1_IS_CLK_ENABLED()            LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_IS_CLK_ENABLED()            LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_IS_CLK_ENABLED()          LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(COMP1)
#define __HAL_RCC_COMP_IS_CLK_ENABLED()            LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC)
#define __HAL_RCC_DAC_IS_CLK_ENABLED()             LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_IS_CLK_ENABLED()             LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_RTC)

#define __HAL_RCC_WDG_IS_CLK_ENABLED()             LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_IS_CLK_ENABLED()           LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_IS_CLK_ENABLED()           LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM17)
#endif

#if defined(TIM1)
#define __HAL_RCC_TIM1_IS_CLK_DISABLED()           !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM1))
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_IS_CLK_DISABLED()           !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM2))
#endif
#define __HAL_RCC_SYSCFG_IS_CLK_DISABLED()         !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_SYSCFG))
#if defined(COMP1)
#define __HAL_RCC_COMP_IS_CLK_DISABLED()           !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_COMP))
#endif
#if defined(DAC)
#define __HAL_RCC_DAC_IS_CLK_DISABLED()            !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_DAC))
#endif
#define __HAL_RCC_RTC_IS_CLK_DISABLED()            !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_RTC))

#define __HAL_RCC_WDG_IS_CLK_DISABLED()            !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_WDG))
#if defined(TIM16)
#define __HAL_RCC_TIM16_IS_CLK_DISABLED()          !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM16))
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_IS_CLK_DISABLED()          !(LL_APB0_GRP1_IsEnabledClock(LL_APB0_GRP1_PERIPH_TIM17))
#endif
/**
  * @}
  */


/** @defgroup RCC_APB1_Clock_Enable_Disable_Status APB1 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB1 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#if defined(SPI1)
#define __HAL_RCC_SPI1_IS_CLK_ENABLED()            LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADCDIG_IS_CLK_ENABLED()          LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_ADCANA_IS_CLK_ENABLED()          LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_ADCANA)
#define __HAL_RCC_LPUART1_IS_CLK_ENABLED()         LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_IS_CLK_ENABLED()          LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART1)
#if defined(SPI2)
#define __HAL_RCC_SPI2_IS_CLK_ENABLED()            LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI2)
#endif
#if defined(SPI3)
#define __HAL_RCC_SPI3_IS_CLK_ENABLED()            LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI3)
#endif
#if defined(I2C1)
#define __HAL_RCC_I2C1_IS_CLK_ENABLED()            LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_IS_CLK_ENABLED()            LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C2)
#endif

#if defined(SPI1)
#define __HAL_RCC_SPI1_IS_CLK_DISABLED()           !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI1))
#endif
#define __HAL_RCC_ADCDIG_IS_CLK_DISABLED()         !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_ADCDIG))
#define __HAL_RCC_ADCANA_IS_CLK_DISABLED()         !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_ADCANA))
#define __HAL_RCC_LPUART1_IS_CLK_DISABLED()        !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_LPUART1))
#define __HAL_RCC_USART1_IS_CLK_DISABLED()         !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_USART1))
#if defined(SPI2)
#define __HAL_RCC_SPI2_IS_CLK_DISABLED()           !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI2))
#endif
#if defined(SPI3)
#define __HAL_RCC_SPI3_IS_CLK_DISABLED()           !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_SPI3))
#endif
#if defined(I2C1)
#define __HAL_RCC_I2C1_IS_CLK_DISABLED()           !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C1))
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_IS_CLK_DISABLED()           !(LL_APB1_GRP1_IsEnabledClock(LL_APB1_GRP1_PERIPH_I2C2))
#endif
/**
  * @}
  */

