stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_rcc.h
/** @defgroup RCC_APB2_Clock_Enable_Disable_Status APB2 Peripheral Clock Enabled or Disabled Status
  * @brief  Check whether the APB2 peripheral clock is enabled or not.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#if defined(BLUE)
#define __HAL_RCC_RADIO_IS_CLK_ENABLED()            LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_MRBLE)

#define __HAL_RCC_RADIO_IS_CLK_DISABLED()           !(LL_APB2_GRP1_IsEnabledClock(LL_APB2_GRP1_PERIPH_MRBLE))
#endif

/**
  * @}
  */

/** @defgroup RCC_AHB_Force_Release_Reset AHB Peripheral Force Release Reset
  * @brief  Force or release AHB peripheral reset.
  * @{
  */
#define __HAL_RCC_AHB1_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_ALL)
#define __HAL_RCC_DMA_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_GPIOA_FORCE_RESET()           LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_FORCE_RESET()           LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_CRC_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_CRC)
#if defined(PKA)
#define __HAL_RCC_PKA_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_PKA)
#endif
#define __HAL_RCC_RNG_FORCE_RESET()             LL_AHB1_GRP1_ForceReset(LL_AHB1_GRP1_PERIPH_RNG)

#define __HAL_RCC_AHB1_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_ALL)
#define __HAL_RCC_DMA_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_DMA)
#define __HAL_RCC_GPIOA_RELEASE_RESET()         LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_GPIOA)
#define __HAL_RCC_GPIOB_RELEASE_RESET()         LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_GPIOB)
#define __HAL_RCC_CRC_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_CRC)
#if defined(PKA)
#define __HAL_RCC_PKA_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_PKA)
#endif
#define __HAL_RCC_RNG_RELEASE_RESET()           LL_AHB1_GRP1_ReleaseReset(LL_AHB1_GRP1_PERIPH_RNG)


/**
  * @}
  */

/** @defgroup RCC_APB0_Force_Release_Reset APB0 Peripheral Force Release Reset
  * @brief  Force or release APB0 peripheral reset.
  * @{
  */

#define __HAL_RCC_APB0_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_ALL)
#if defined(TIM1)
#define __HAL_RCC_TIM1_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_FORCE_RESET()          LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(COMP1)
#define __HAL_RCC_COMP_FORCE_RESET()            LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC)
#define __HAL_RCC_DAC_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_RTC)

#define __HAL_RCC_WDG_FORCE_RESET()             LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_FORCE_RESET()           LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_FORCE_RESET()           LL_APB0_GRP1_ForceReset(LL_APB0_GRP1_PERIPH_TIM17)
#endif

#define __HAL_RCC_APB0_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_ALL)
#if defined(TIM1)
#define __HAL_RCC_TIM1_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM1)
#endif
#if defined(TIM2)
#define __HAL_RCC_TIM2_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM2)
#endif
#define __HAL_RCC_SYSCFG_RELEASE_RESET()        LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_SYSCFG)
#if defined(COMP1)
#define __HAL_RCC_COMP_RELEASE_RESET()          LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_COMP)
#endif
#if defined(DAC)
#define __HAL_RCC_DAC_RELEASE_RESET()           LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_DAC)
#endif
#define __HAL_RCC_RTC_RELEASE_RESET()           LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_RTC)

#define __HAL_RCC_WDG_RELEASE_RESET()           LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_WDG)
#if defined(TIM16)
#define __HAL_RCC_TIM16_RELEASE_RESET()         LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM16)
#endif
#if defined(TIM17)
#define __HAL_RCC_TIM17_RELEASE_RESET()         LL_APB0_GRP1_ReleaseReset(LL_APB0_GRP1_PERIPH_TIM17)
#endif
/**
  * @}
  */

/** @defgroup RCC_APB1_Force_Release_Reset APB1 Peripheral Force Release Reset
  * @brief  Force or release APB1 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB1_FORCE_RESET()            LL_APB1_GRP1_ForceReset( LL_APB1_GRP1_RESET_PERIPH_ALL)

#if defined(SPI1)
#define __HAL_RCC_SPI1_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADC_FORCE_RESET()             LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_LPUART1_FORCE_RESET()         LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_FORCE_RESET()          LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_USART1)
#if defined(SPI2)
#define __HAL_RCC_SPI2_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_SPI2)
#endif
#if defined(SPI3)
#define __HAL_RCC_SPI3_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_SPI3)
#endif
#if defined(I2C1)
#define __HAL_RCC_I2C1_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_FORCE_RESET()            LL_APB1_GRP1_ForceReset(LL_APB1_GRP1_PERIPH_I2C2)
#endif

#define __HAL_RCC_APB1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset( LL_APB1_GRP1_RESET_PERIPH_ALL)

#if defined(SPI1)
#define __HAL_RCC_SPI1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_SPI1)
#endif
#define __HAL_RCC_ADC_RELEASE_RESET()           LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_ADCDIG)
#define __HAL_RCC_LPUART1_RELEASE_RESET()       LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_LPUART1)
#define __HAL_RCC_USART1_RELEASE_RESET()        LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_USART1)
#if defined(SPI2)
#define __HAL_RCC_SPI2_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_SPI2)
#endif
#if defined(SPI3)
#define __HAL_RCC_SPI3_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_SPI3)
#endif
#if defined(I2C1)
#define __HAL_RCC_I2C1_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C1)
#endif
#if defined(I2C2)
#define __HAL_RCC_I2C2_RELEASE_RESET()          LL_APB1_GRP1_ReleaseReset(LL_APB1_GRP1_PERIPH_I2C2)
#endif
/**
  * @}
  */

/** @defgroup RCC_APB2_Force_Release_Reset APB2 Peripheral Force Release Reset
  * @brief  Force or release APB2 peripheral reset.
  * @{
  */
#define __HAL_RCC_APB2_FORCE_RESET()             LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_ALL)
#if defined(BLUE)
#define __HAL_RCC_RADIO_FORCE_RESET()            LL_APB2_GRP1_ForceReset(LL_APB2_GRP1_PERIPH_MRBLE)
#endif

#define __HAL_RCC_APB2_RELEASE_RESET()           LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_ALL)
#if defined(BLUE)
#define __HAL_RCC_RADIO_RELEASE_RESET()          LL_APB2_GRP1_ReleaseReset(LL_APB2_GRP1_PERIPH_MRBLE)
#endif

/**
  * @}
  */

/** @defgroup RCC_CLK_CONFIG_MACROS Clock Configuration Macros
  * @{
  */
/** @defgroup RCC_LSI_MACROS LSI Macros
  * @{
  */

 /**
  * @brief  Macro to configure the Internal High Speed oscillator (HSI).
  * @note   After enabling the HSI (RCC_HSI_ON), the application
  *         software should wait on HSIRDY flag to be set indicating that HSI clock
  *         is stable.
  * @note   The HSI is stopped by hardware when entering DEEPSTOP and SHUTDOWN modes.
  * @param  __STATE__  specifies the new state of the HSE.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_HSE_OFF  Turn OFF the HSE oscillator.
  *            @arg @ref RCC_HSE_ON  Turn ON the HSE oscillator.
  * @retval None
  */
#define __HAL_RCC_HSI_CONFIG(__STATE__)    \
  do {                                     \
    if((__STATE__) == RCC_HSI_ON)          \
    {                                      \
      LL_RCC_HSI_Enable();                 \
    }                                      \
    else                                   \
    {                                      \
      LL_RCC_HSI_Disable();                \
    }                                      \
  } while(0U)

/**
  * @brief  Macro to get the HSI ready flag.
  * @retval Returns the Ready Flag status
  */
#define __HAL_RCC_GET_HSI_READYFLAG() LL_RCC_HSI_IsReady()

