stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_rcc.h
/** @defgroup RCC_MCO_CONFIG_MACROS Main Configurable Clock Output Selection Macros
  * @{
  */
/**
  * @brief  Macro to configure the MCO clock.
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCOSOURCE_NOCLOCK          MCO output disabled
  *            @arg @ref RCC_MCO1SOURCE_SYSCLK           System  clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_HSI              HSI clock selected as MCO source
  *            @arg @ref RCC_MCO1SOURCE_HSE              HSE clock selected as MCO source
  *            @arg @ref RCC_MCOSOURCE_RC64MPLL         Main PLL clock selected as MCO source
  *            @arg @ref RCC_MCOSOURCE_HSI64M_DIV2048   HSI div 2048 clock selected as MCO source
  *            @arg @ref RCC_MCOSOURCE_SMPS             SMPS clock selected as MCO source
  *            @arg @ref RCC_MCOSOURCE_ADC              ADC clock selected as MCO source

  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_MCODIV_1   MCO clock source is divided by 1
  *            @arg @ref RCC_MCODIV_2   MCO clock source is divided by 2
  *            @arg @ref RCC_MCODIV_4   MCO clock source is divided by 4
  *            @arg @ref RCC_MCODIV_8   MCO clock source is divided by 8
  *            @arg @ref RCC_MCODIV_16  MCO clock source is divided by 16
  *            @arg @ref RCC_MCODIV_32  MCO clock source is divided by 32

  */
#define __HAL_RCC_MCO1_CONFIG(__MCOCLKSOURCE__, __MCODIV__)  LL_RCC_ConfigMCO((__MCOCLKSOURCE__), (__MCODIV__))
/**
  * @}
  */
/**
  * @}
  */
/** @defgroup RCC_Flags_Interrupts_Management Flags Interrupts Management
  * @brief macros to manage the specified RCC Flags and interrupts.
  * @{
  */
/** @brief  Enable RCC interrupt.
  * @param  __INTERRUPT__  specifies the RCC interrupt sources to be enabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY        LSI ready interrupt enable
  *            @arg RCC_IT_LSERDY        LSE ready interrupt enable
  *            @arg RCC_IT_HSIRDY        HSI ready interrupt enable
  *            @arg RCC_IT_HSERDY        HSE ready interrupt enable
  *            @arg RCC_IT_PLLRDY        Main PLL ready interrupt enable
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL unlock interrupt enable
  *            @arg RCC_IT_RTCRSTRELRDY  RTC Reset Release ready interrupt enable
  *            @arg RCC_IT_WDGRSTRELRDY  WDG Reset Release ready interrupt enable
  *            @arg RCC_IT_LPURSTRELRDY  LPU Reset Release ready interrupt enable
  * @retval None
  */
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) SET_BIT(RCC->CIER, (__INTERRUPT__))

/** @brief Disable RCC interrupt.
  * @param  __INTERRUPT__  specifies the RCC interrupt sources to be disabled.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY        LSI ready interrupt disable
  *            @arg RCC_IT_LSERDY        LSE ready interrupt disable
  *            @arg RCC_IT_HSIRDY        HSI ready interrupt disable
  *            @arg RCC_IT_HSERDY        HSE ready interrupt disable
  *            @arg RCC_IT_PLLRDY        Main PLL ready interrupt disable
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL Unlock interrupt disable
  *            @arg RCC_IT_RTCRSTRELRDY  RTC Reset Release ready interrupt disable
  *            @arg RCC_IT_WDGRSTRELRDY  WDG Reset Release ready interrupt disable
  *            @arg RCC_IT_LPURSTRELRDY  LPU Reset Release ready interrupt disable
  * @retval None
  */
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) CLEAR_BIT(RCC->CIER, (__INTERRUPT__))

/** @brief  Clear RCC interrupt pending bits (Perform Byte access to RCC_CICR[17:0]
  *         bits to clear the selected interrupt pending bits.
  * @param  __INTERRUPT__  specifies the interrupt pending bit to clear.
  *         This parameter can be any combination of the following values:
  *            @arg RCC_IT_LSIRDY        LSI ready interrupt clear
  *            @arg RCC_IT_LSERDY        LSE ready interrupt clear
  *            @arg RCC_IT_HSIRDY        HSI ready interrupt clear
  *            @arg RCC_IT_HSERDY        HSE ready interrupt clear
  *            @arg RCC_IT_PLLRDY        Main PLL ready interrupt clear
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL Unlock interrupt clear
  *            @arg RCC_IT_RTCRSTRELRDY  RTC Reset Release ready interrupt clear
  *            @arg RCC_IT_WDGRSTRELRDY  WDG Reset Release ready interrupt clear
  *            @arg RCC_IT_LPURSTRELRDY  LPU Reset Release ready interrupt clear
  */
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (RCC->CIFR = (__INTERRUPT__))

/** @brief  Check whether the RCC interrupt has occurred or not.
  * @param  __INTERRUPT__  specifies the RCC interrupt source to check.
  *         This parameter can be one of the following values:
  *            @arg RCC_IT_LSIRDY        LSI ready interrupt flag
  *            @arg RCC_IT_LSERDY        LSE ready interrupt flag
  *            @arg RCC_IT_HSIRDY        HSI ready interrupt flag
  *            @arg RCC_IT_HSERDY        HSE ready interrupt flag
  *            @arg RCC_IT_PLLRDY        Main PLL ready interrupt flag
  *            @arg RCC_IT_PLL_UNLOCKRDY PLL Unlock interrupt flag
  *            @arg RCC_IT_RTCRSTRELRDY  RTC Reset Release ready interrupt flag
  *            @arg RCC_IT_WDGRSTRELRDY  WDG Reset Release ready interrupt flag
  *            @arg RCC_IT_LPURSTRELRDY  LPU Reset Release ready interrupt flag
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((RCC->CIFR & (__INTERRUPT__)) == (__INTERRUPT__))
/**
  * @}
  */

/** @defgroup RCC_Reset_Status_Management Rest Status Flags Management
  * @brief macros to manage the specified RCC Reset Flags.
  * @{
  */
/** @brief Set RMVF bit to clear the reset flags.
  *        The reset flags are: RCC_FLAG_LOCKUPRST, RCC_FLAG_WDGRST, RCC_FLAG_SFTRST,
  *                             RCC_FLAG_PORRST and RCC_FLAG_PADRSTF.
  * @retval None
 */
#define __HAL_RCC_CLEAR_RESET_FLAGS() LL_RCC_ClearResetFlags()

