stm32duino/Arduino_Core_STM32/system/Drivers/STM32WB0x_HAL_Driver/Inc/stm32wb0x_hal_rcc.h
/** @brief  Check whether the selected RCC Reset flag is set or not.
  * @param  __FLAG__  specifies the flag to check.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_FLAG_LOCKUPRST   CPU lockup reset flag
  *            @arg @ref RCC_FLAG_WDGRST      Watchdog reset flag
  *            @arg @ref RCC_FLAG_SFTRST      Software reset flag
  *            @arg @ref RCC_FLAG_PORRST      Power-On or BOR reset flag
  *            @arg @ref RCC_FLAG_PADRSTF      NRSTn pad reset flag
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RCC_GET_FLAG(__FLAG__) (((__FLAG__) & 0x3FFFF) ?\
                                      ((RCC->CR & (__FLAG__)) == (__FLAG__)) :\
                                      ((RCC->CSR & (__FLAG__)) == (__FLAG__)))

/**
  * @}
  */

/** @defgroup RCC_HSECLK_BUFFER_RF_MACROS External high speed clock buffer for PLL RF2G4
  * @{
  */
/** @brief  Macros to enable or disable the high speed clock buffer for PLL RF2G4.
  * @retval Status of the high speed clock buffer for PLL RF2G4
  */
#define __HAL_RCC_HSEPLLBUFON_ENABLE()          LL_RCC_HSEPLLBUFON_Enable()
#define __HAL_RCC_HSEPLLBUFON_DISABLE()         LL_RCC_HSEPLLBUFON_Disable()

/** @brief  Macros to read the status of the high speed clock buffer for PLL RF2G4.
  * @retval Configuration status
  */
#define __HAL_RCC_HSEPLLBUFON_IS_ENABLED()  LL_RCC_HSEPLLBUFON_Disable()
/**
  * @}
  */

/** @defgroup RCC_CLOCK_SWITCH_MACROS Clock switch macros
  * @{
  */
/** @brief  Set RC64MPLL prescaler to switch the clock when the MR_BLE is enabled.
  * @note   The CPU/system frequency must be kept at minimum 16 MHz clock when the radio is used.
  * @param  __PLLD__  specifies the DIRECT_HSE or RC64MPLL value to setup.
  *         This parameter can be one of the following values:
  *            @arg @ref RCC_DIRECT_HSE_SWITCH_DIV1      DIRECT HSE division factor = 1
  *            @arg @ref RCC_DIRECT_HSE_SWITCH_DIV2      DIRECT HSE division factor = 2
  *            @arg @ref RCC_RC64MPLL_SWITCH_DIV1        RC64MPLL division factor = 1
  *            @arg @ref RCC_RC64MPLL_SWITCH_DIV2        RC64MPLL division factor = 2
  *            @arg @ref RCC_RC64MPLL_SWITCH_DIV4        RC64MPLL division factor = 4
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  */
#define __HAL_RCC_CLOCK_SWITCH(__PLLD__)        \
  do {                                                                                \
    if (LL_RCC_GetRC64MPLLSwitchStatus() == LL_RCC_RC64MPLL_SWITCH_STATUS_IDLE)       \
    {                                                                                 \
      LL_RCC_SwitchRC64MPLLPrescaler(__PLLD__);                                 \
      LL_RCC_RequestSwitchRC64MPLLClock();                                    \
      while (LL_RCC_GetRC64MPLLSwitchStatus() != LL_RCC_RC64MPLL_SWITCH_STATUS_DONE); \
      LL_RCC_ClearFlag_EOFSEQ();                                                      \
    }                                                                                 \
  } while(0U)

/** @brief  Macros to enable or disable the interrupt of the CPU / system clock frequency switch.
  * @retval Status of the interrupt of the CPU / system clock frequency switch
  */
#define __HAL_RCC_CLOCK_SWITCH_IT_ENABLE()             LL_RCC_EnableIT_EOFSEQ()
#define __HAL_RCC_CLOCK_SWITCH_IT_DISABLE()            LL_RCC_DisableIT_EOFSEQ()

/** @brief  Macros to read the configuration status of the interrupt of the CPU / system clock frequency switch.
  * @retval Interrupt Enable status
  */
#define __HAL_RCC_CLOCK_SWITCH_INTERRUPT_IS_ENABLED()  LL_RCC_IsEnabledIT_EOFSEQ()

/** @brief  Macros to read the status of the interrupt of the CPU / system clock frequency switch.
  * @retval Interrupt status
  */
#define __HAL_RCC_CLOCK_SWITCH_INTERRUPT_STATUS()   LL_RCC_IsActiveFlag_EOFSEQ()

/** @brief  Macros to clear the status of the interrupt of the CPU / system clock frequency switch.
  * @retval Clear Interrupt status
  */
#define __HAL_RCC_CLOCK_SWITCH_CLEAR_INTERRUPT_STATUS()  LL_RCC_ClearFlag_EOFSEQ()
/**
  * @}
  */

/**
  * @}
  */

/* Include RCC HAL Extended module */
#include "stm32wb0x_hal_rcc_ex.h"

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCC_Exported_Functions
  * @{
  */


/** @addtogroup RCC_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ******************************/
HAL_StatusTypeDef HAL_RCC_DeInit(void);
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, uint32_t FLatency);

/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  ************************************************/
void       HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv);
uint32_t   HAL_RCC_GetSysClockFreq(void);

void       HAL_RCC_GetOscConfig(RCC_OscInitTypeDef *RCC_OscInitStruct);
void       HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef *RCC_ClkInitStruct, uint32_t *pFLatency);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32WB0x_HAL_RCC_H */
